## 1. Cutlets

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as stats

In [8]:
data1 = pd.read_csv(r"C:\Users\ADMIN\assignment\assignment 3\Cutlets.csv")

In [9]:
data1.head(8)

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522
5  7.3871  6.8110
6  6.8755  7.2212
7  7.0621  6.6606

#### here in this data our null hypotesis H.=unit A- unit B =0
                                     #Ha=unit a != unitB

In [10]:
stats.ttest_ind(data1['Unit A'],data1['Unit B'])

TtestResult(statistic=0.7228688704678063, pvalue=0.47223947245995, df=68.0)

In [7]:
# in this case p value is greter than the alpha value then accept null hypotesis

## 2. LabTAT

In [11]:
data2 = pd.read_csv(r"C:\Users\ADMIN\assignment\assignment 3\LabTAT.csv")

In [13]:
data2.head(8)

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60
5        179.45        197.00        181.51        161.12
6        191.37        166.36        214.21        154.02
7        166.81        169.60        183.43        163.25

#### hear we are using anova concept to solve this qustion
#### hera H.=all are the same and Ha=at least one of them are diffrent

In [15]:
stats.f_oneway(data2['Laboratory 1'],data2['Laboratory 2'],data2['Laboratory 3'],data2['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [16]:
# here the p_value is lesser than the our alpha value because we are rejecting  H.

### 3.BuyerRatio

In [17]:
data3 = pd.read_csv(r"C:\Users\ADMIN\assignment\assignment 3\BuyerRatio.csv")

In [18]:
data3

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [19]:
data_1 = data3.drop('Observed Values' ,axis=1)

In [20]:
stats.chi2_contingency(data_1)

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [21]:
# here we accepting the null hypothesis

### 4.Customer Order

In [22]:
data_2 = pd.read_csv(r"C:\Users\ADMIN\assignment\assignment 3\Costomer+OrderForm.csv")

In [23]:
data_2.head(7)

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free
5   Error Free  Error Free  Error Free  Error Free
6   Error Free   Defective  Error Free  Error Free

In [24]:
from sklearn.preprocessing import LabelEncoder,OneHotEncoder,OrdinalEncoder

In [26]:
lb = OrdinalEncoder()
data_encoded = lb.fit_transform(data_2)

In [27]:
data_pre = pd.DataFrame(data_encoded)

In [28]:
stats.f_oneway(data_pre[0],data_pre[1],data_pre[2],data_pre[3])

F_onewayResult(statistic=1.286168556089167, pvalue=0.2776780955705948)

In [29]:
# here H.=0